# DataFrames

In [2]:
import pandas as pd
import numpy as np
%config IPCompleter.greedy=True

In [3]:
from numpy.random import randn
np.random.seed(101)

In [4]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [5]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame
- df['W']
- df[['W','Z']]
- df.W -- SQL syntax - not recommended

DataFrame Columns are just Series
- check the type of df['W']

**Creating a new column:**
- new column by addition of two columns df['W'] + df['Y']
- new column by assigning a scalar value df['age']=40

In [12]:
df['totalprice']=df['W']*df['X']
df

          W         X         Y         Z  totalprice
A  2.706850  0.628133  0.907969  0.503826    1.700261
B  0.651118 -0.319318 -0.848077  0.605965   -0.207914
C -2.018168  0.740122  0.528813 -0.589001   -1.493691
D  0.188695 -0.758872 -0.933237  0.955057   -0.143196
E  0.190794  1.978757  2.605967  0.683509    0.377536

In [14]:
df['default_age']=18
df

          W         X         Y         Z  totalprice  default_age
A  2.706850  0.628133  0.907969  0.503826    1.700261           18
B  0.651118 -0.319318 -0.848077  0.605965   -0.207914           18
C -2.018168  0.740122  0.528813 -0.589001   -1.493691           18
D  0.188695 -0.758872 -0.933237  0.955057   -0.143196           18
E  0.190794  1.978757  2.605967  0.683509    0.377536           18

** Removing Columns**
- df.drop(<name of the column>, axis = 1)
- df.drop(<name of the row>, axis = 0)
- use inplace for permanent drop

** Selecting Columns**

In [6]:
df[['W','X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [7]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [9]:
df['W']['A']

2.706849839399938

In [10]:
df.loc['A']['W']

2.706849839399938

In [16]:
df.drop('A')

          W         X         Y         Z  totalprice  default_age
B  0.651118 -0.319318 -0.848077  0.605965   -0.207914           18
C -2.018168  0.740122  0.528813 -0.589001   -1.493691           18
D  0.188695 -0.758872 -0.933237  0.955057   -0.143196           18
E  0.190794  1.978757  2.605967  0.683509    0.377536           18

In [22]:
df.drop('W', axis=1)

          X         Y         Z  totalprice  default_age
A  0.628133  0.907969  0.503826    1.700261           18
B -0.319318 -0.848077  0.605965   -0.207914           18
C  0.740122  0.528813 -0.589001   -1.493691           18
D -0.758872 -0.933237  0.955057   -0.143196           18
E  1.978757  2.605967  0.683509    0.377536           18

In [24]:
df

          W         X         Y         Z  totalprice  default_age
A  2.706850  0.628133  0.907969  0.503826    1.700261           18
B  0.651118 -0.319318 -0.848077  0.605965   -0.207914           18
C -2.018168  0.740122  0.528813 -0.589001   -1.493691           18
D  0.188695 -0.758872 -0.933237  0.955057   -0.143196           18
E  0.190794  1.978757  2.605967  0.683509    0.377536           18

In [25]:
df2 = df
df2.drop('A', inplace=True)
df2

          W         X         Y         Z  totalprice  default_age
B  0.651118 -0.319318 -0.848077  0.605965   -0.207914           18
C -2.018168  0.740122  0.528813 -0.589001   -1.493691           18
D  0.188695 -0.758872 -0.933237  0.955057   -0.143196           18
E  0.190794  1.978757  2.605967  0.683509    0.377536           18

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [27]:
df[df['W']>0]

          W         X         Y         Z  totalprice  default_age
B  0.651118 -0.319318 -0.848077  0.605965   -0.207914           18
D  0.188695 -0.758872 -0.933237  0.955057   -0.143196           18
E  0.190794  1.978757  2.605967  0.683509    0.377536           18

In [28]:
df [(df['W'] + df['Y'])>1]

          W         X         Y         Z  totalprice  default_age
E  0.190794  1.978757  2.605967  0.683509    0.377536           18

In [29]:
df [(df['W'] + df['Y'])>1]['W']

E    0.190794
Name: W, dtype: float64

In [30]:
df [(df['W'] + df['Y'])>1][['W', 'X']]

          W         X
E  0.190794  1.978757

In [32]:
df [(df['W'] > 0) & (df['Y'] > 0)][['W', 'X']]

          W         X
E  0.190794  1.978757

In [40]:
df.T[(df.T['B'] + df.T['C'])>1]

                B     C     D     E
default_age  18.0  18.0  18.0  18.0

In [41]:
df.T[(df.T['B'] + df.T['C'])>1][['B', 'C']]

                B     C
default_age  18.0  18.0